RIET/src/InformationRegisters/СтатусыРеестровLog/СтатусыРеестровLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРеестровLog</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Text</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>LogTo</name>
    <type>
      <types>CatalogRef.Реестры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LogType</name>
    <type>
      <types>CatalogRef.LogTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/СтатусыРеестровLog/ManagerModule.bsl
Функция ДатаЗавершенияОбработкиКоординатором(Реестр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтатусыРеестровLog.Date как ДатаСтатуса
	|ИЗ
	|	РегистрСведений.СтатусыРеестровLog КАК СтатусыРеестровLog
	|ГДЕ
	|	СтатусыРеестровLog.LogTo = &Реестр
	|	И СтатусыРеестровLog.LogType = ЗНАЧЕНИЕ(Справочник.LogTypes.ИзменениеСтатуса)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыРеестровLog.Date";
	
	Запрос.УстановитьПараметр("Реестр", Реестр);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ДатаСтатуса;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
